backend: tensorflow
class_name: Model
config:
  input_layers:
  - - comment_text
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 300
      - 1
      dtype: float32
      name: comment_text
      sparse: false
    inbound_nodes: []
    name: comment_text
  - class_name: Conv1D
    config:
      activation: tanh
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 300
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      kernel_size: !!python/tuple
      - 3
      name: conv1d_17
      padding: valid
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - comment_text
        - 0
        - 0
        - {}
    name: conv1d_17
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      name: max_pooling1d_17
      padding: valid
      pool_size: !!python/tuple
      - 2
      strides: !!python/tuple
      - 2
      trainable: true
    inbound_nodes:
    - - - conv1d_17
        - 0
        - 0
        - {}
    name: max_pooling1d_17
  - class_name: Conv1D
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      name: conv1d_18
      padding: valid
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_17
        - 0
        - 0
        - {}
    name: conv1d_18
  - class_name: SpatialDropout1D
    config:
      name: spatial_dropout1d_9
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - conv1d_18
        - 0
        - 0
        - {}
    name: spatial_dropout1d_9
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      name: max_pooling1d_18
      padding: valid
      pool_size: !!python/tuple
      - 2
      strides: !!python/tuple
      - 2
      trainable: true
    inbound_nodes:
    - - - spatial_dropout1d_9
        - 0
        - 0
        - {}
    name: max_pooling1d_18
  - class_name: Conv1D
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      name: conv1d_19
      padding: valid
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_18
        - 0
        - 0
        - {}
    name: conv1d_19
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      name: max_pooling1d_19
      padding: valid
      pool_size: !!python/tuple
      - 2
      strides: !!python/tuple
      - 2
      trainable: true
    inbound_nodes:
    - - - conv1d_19
        - 0
        - 0
        - {}
    name: max_pooling1d_19
  - class_name: SpatialDropout1D
    config:
      name: spatial_dropout1d_10
      noise_shape: null
      rate: 0.1
      seed: null
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_19
        - 0
        - 0
        - {}
    name: spatial_dropout1d_10
  - class_name: Conv1D
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      name: conv1d_20
      padding: valid
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - spatial_dropout1d_10
        - 0
        - 0
        - {}
    name: conv1d_20
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      name: max_pooling1d_20
      padding: valid
      pool_size: !!python/tuple
      - 2
      strides: !!python/tuple
      - 2
      trainable: true
    inbound_nodes:
    - - - conv1d_20
        - 0
        - 0
        - {}
    name: max_pooling1d_20
  - class_name: Flatten
    config:
      data_format: channels_last
      name: flatten_5
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_20
        - 0
        - 0
        - {}
    name: flatten_5
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_5
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - flatten_5
        - 0
        - 0
        - {}
    name: dense_5
  - class_name: Dropout
    config:
      name: dropout_5
      noise_shape: null
      rate: 0.5
      seed: null
      trainable: true
    inbound_nodes:
    - - - dense_5
        - 0
        - 0
        - {}
    name: dropout_5
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: prediction
      trainable: true
      units: 10
      use_bias: true
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - {}
    name: prediction
  name: model_4
  output_layers:
  - - prediction
    - 0
    - 0
keras_version: 2.2.4
